Even when I set it to create the gateway, the result is the same:

initial plan that I then apply:

```hcl
  # azurerm_hdinsight_kafka_cluster.this will be created
  + resource "azurerm_hdinsight_kafka_cluster" "this" {
      + cluster_version     = "4.0.1000.0"
      + https_endpoint      = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "my-test-kafka-cluster"
      + resource_group_name = "di-nonprod"
      + ssh_endpoint        = (known after apply)
      + tags                = {
          + "ClusterName" = "di"
          + "Environment" = "nonprod"
          + "created-by"  = "terraform"
          + "owner"       = "yevgen.flerko.osv@fedex.com"
        }
      + tier                = "Standard"

      + component_version {
          + kafka = "1.0"
        }

      + gateway {
          + enabled  = true
          + password = (sensitive value)
          + username = (known after apply)
        }

      + roles {
          + head_node {
              + password           = (sensitive value)
              + subnet_id          = "/subscriptions/321372a9-8716-46f9-a18a-d4928222041b/resourceGroups/neur-fxi-nonprod-network-rg/providers/Microsoft.Network/virtualNetworks/neur-fxi-nonprod-main-vnet/subnets/aks-di"
              + username           = (known after apply)
              + virtual_network_id = "/subscriptions/321372a9-8716-46f9-a18a-d4928222041b/resourceGroups/neur-fxi-nonprod-network-rg/providers/Microsoft.Network/virtualNetworks/neur-fxi-nonprod-main-vnet"
              + vm_size            = "Standard_D3_V2"
            }

          + worker_node {
              + min_instance_count       = 3
              + number_of_disks_per_node = 1
              + password                 = (sensitive value)
              + subnet_id                = "/subscriptions/321372a9-8716-46f9-a18a-d4928222041b/resourceGroups/neur-fxi-nonprod-network-rg/providers/Microsoft.Network/virtualNetworks/neur-fxi-nonprod-main-vnet/subnets/aks-di"
              + target_instance_count    = 3
              + username                 = (known after apply)
              + virtual_network_id       = "/subscriptions/321372a9-8716-46f9-a18a-d4928222041b/resourceGroups/neur-fxi-nonprod-network-rg/providers/Microsoft.Network/virtualNetworks/neur-fxi-nonprod-main-vnet"
              + vm_size                  = "Standard_D3_V2"
            }

          + zookeeper_node {
              + password           = (sensitive value)
              + subnet_id          = "/subscriptions/321372a9-8716-46f9-a18a-d4928222041b/resourceGroups/neur-fxi-nonprod-network-rg/providers/Microsoft.Network/virtualNetworks/neur-fxi-nonprod-main-vnet/subnets/aks-di"
              + username           = (known after apply)
              + virtual_network_id = "/subscriptions/321372a9-8716-46f9-a18a-d4928222041b/resourceGroups/neur-fxi-nonprod-network-rg/providers/Microsoft.Network/virtualNetworks/neur-fxi-nonprod-main-vnet"
              + vm_size            = "Standard_D3_V2"
            }
        }

      + storage_account {
          + is_default           = true
          + storage_account_key  = (sensitive value)
          + storage_container_id = (known after apply)
        }
    }

  # azurerm_storage_account.tnt_kafka will be created
  + resource "azurerm_storage_account" "tnt_kafka" {
      + access_tier                      = (known after apply)
      + account_kind                     = "StorageV2"
      + account_replication_type         = "GRS"
      + account_tier                     = "Standard"
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + location                         = "northeurope"
      + name                             = "std9e625770f860d2663b1b8"
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = "di-nonprod"
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + tags                             = {
          + "ClusterName" = "di"
          + "Environment" = "nonprod"
          + "created-by"  = "terraform"
          + "owner"       = "yevgen.flerko.osv@fedex.com"
        }

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }
    }

  # azurerm_storage_container.this will be created
  + resource "azurerm_storage_container" "this" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "test-kafka-storage"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "std9e625770f860d2663b1b8"
    }

  # random_password.gateway_password will be created
  + resource "random_password" "gateway_password" {
      + id          = (known after apply)
      + length      = 18
      + lower       = true
      + min_lower   = 1
      + min_numeric = 1
      + min_special = 1
      + min_upper   = 1
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.kafka_password will be created
  + resource "random_password" "kafka_password" {
      + id          = (known after apply)
      + length      = 18
      + lower       = true
      + min_lower   = 1
      + min_numeric = 1
      + min_special = 1
      + min_upper   = 1
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.zookeeper_password will be created
  + resource "random_password" "zookeeper_password" {
      + id          = (known after apply)
      + length      = 18
      + lower       = true
      + min_lower   = 1
      + min_numeric = 1
      + min_special = 1
      + min_upper   = 1
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_string.gateway_username will be created
  + resource "random_string" "gateway_username" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 2
      + min_numeric = 2
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.kafka_username will be created
  + resource "random_string" "kafka_username" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 2
      + min_numeric = 2
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.zookeeper_username will be created
  + resource "random_string" "zookeeper_username" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 2
      + min_numeric = 2
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

Then, without changing anything the plan output is:

```hcl
Terraform will perform the following actions:

  # azurerm_hdinsight_kafka_cluster.this must be replaced
-/+ resource "azurerm_hdinsight_kafka_cluster" "this" {
        cluster_version     = "4.0.1000.0"
      ~ https_endpoint      = "my-test-kafka-cluster.azurehdinsight.net" -> (known after apply)
      ~ id                  = "/subscriptions/321372a9-8716-46f9-a18a-d4928222041b/resourceGroups/di-nonprod/providers/Microsoft.HDInsight/clusters/my-test-kafka-cluster" -> (known after apply)
        location            = "northeurope"
        name                = "my-test-kafka-cluster"
        resource_group_name = "di-nonprod"
      ~ ssh_endpoint        = "my-test-kafka-cluster-ssh.azurehdinsight.net" -> (known after apply)
        tags                = {
            "ClusterName" = "di"
            "Environment" = "nonprod"
            "created-by"  = "terraform"
            "owner"       = "yevgen.flerko.osv@fedex.com"
        }
      ~ tier                = "standard" -> "Standard"

        component_version {
            kafka = "1.0"
        }

      ~ gateway {
            enabled  = true
          ~ password = (sensitive value)
            username = "l0drn4oqdvp7"
        }

      ~ roles {
          ~ head_node {
                password           = (sensitive value)
              - ssh_keys           = [] -> null
                subnet_id          = "/subscriptions/321372a9-8716-46f9-a18a-d4928222041b/resourceGroups/neur-fxi-nonprod-network-rg/providers/Microsoft.Network/virtualNetworks/neur-fxi-nonprod-main-vnet/subnets/aks-di"
                username           = "95q2cbpruto3"
                virtual_network_id = "/subscriptions/321372a9-8716-46f9-a18a-d4928222041b/resourceGroups/neur-fxi-nonprod-network-rg/providers/Microsoft.Network/virtualNetworks/neur-fxi-nonprod-main-vnet"
                vm_size            = "Standard_D3_V2"
            }

          ~ worker_node {
              ~ min_instance_count       = 0 -> 3 # forces replacement
                number_of_disks_per_node = 1
                password                 = (sensitive value)
              - ssh_keys                 = [] -> null
                subnet_id                = "/subscriptions/321372a9-8716-46f9-a18a-d4928222041b/resourceGroups/neur-fxi-nonprod-network-rg/providers/Microsoft.Network/virtualNetworks/neur-fxi-nonprod-main-vnet/subnets/aks-di"
                target_instance_count    = 3
                username                 = "95q2cbpruto3"
                virtual_network_id       = "/subscriptions/321372a9-8716-46f9-a18a-d4928222041b/resourceGroups/neur-fxi-nonprod-network-rg/providers/Microsoft.Network/virtualNetworks/neur-fxi-nonprod-main-vnet"
                vm_size                  = "Standard_D3_V2"
            }

          ~ zookeeper_node {
                password           = (sensitive value)
              - ssh_keys           = [] -> null
                subnet_id          = "/subscriptions/321372a9-8716-46f9-a18a-d4928222041b/resourceGroups/neur-fxi-nonprod-network-rg/providers/Microsoft.Network/virtualNetworks/neur-fxi-nonprod-main-vnet/subnets/aks-di"
                username           = "lziisv28avek"
                virtual_network_id = "/subscriptions/321372a9-8716-46f9-a18a-d4928222041b/resourceGroups/neur-fxi-nonprod-network-rg/providers/Microsoft.Network/virtualNetworks/neur-fxi-nonprod-main-vnet"
                vm_size            = "Standard_D3_V2"
            }
        }

        storage_account {
            is_default           = true
            storage_account_key  = (sensitive value)
            storage_container_id = "https://std9e625770f860d2663b1b8.blob.core.windows.net/test-kafka-storage"
        }
    }
```
